🚀&nbsp; env0 had composed a PR Plan for environment [!Tomer! / tf-out-32353 ](http://dev.dev.env0.com/p/6b1b0897-5322-48cd-98b7-5e11766f54c8/environments/ae57739c-ca27-40e1-acf0-d2a0185a7a75):
```
Plan: 3 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform will perform the following actions:


  # aws_instance.example_server will be created
+   resource "aws_instance" "example_server" {
+       ami                                  = "ami-04e914639d0cca79a"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "AnotherTag"          = "AnotherVasdlue"
+           "Name"                = "JacksBlogExample"
+           "env0_environment_id" = "ae57739c-ca27-40e1-acf0-d2a0185a7a75"
+           "env0_project_id"     = "6b1b0897-5322-48cd-98b7-5e11766f54c8"
        }
+       tags_all                             = {
+           "AnotherTag"          = "AnotherVasdlue"
+           "Name"                = "JacksBlogExample"
+           "env0_environment_id" = "ae57739c-ca27-40e1-acf0-d2a0185a7a75"
+           "env0_project_id"     = "6b1b0897-5322-48cd-98b7-5e11766f54c8"
        }
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)
    }

  # null_resource.test will be created
+   resource "null_resource" "test" {
+       id       = (known after apply)
+       triggers = {
+           "timestamp" = (known after apply)
        }
    }

  # module.nuller.null_resource.nuller will be created
+   resource "null_resource" "nuller" {
+       id       = (known after apply)
+       triggers = {
+           "timestamp" = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   bucket         = (known after apply)
+   nuller_complex = {
+       foo     = "12"
+       lalalal = false
    }
+   nuller_id      = (known after apply)
+   tag            = {
+       AnotherTag          = "AnotherVasdlue"
+       Name                = "JacksBlogExample"
+       env0_environment_id = "ae57739c-ca27-40e1-acf0-d2a0185a7a75"
+       env0_project_id     = "6b1b0897-5322-48cd-98b7-5e11766f54c8"
    }
+   this           = (known after apply)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "danny" but a value was
│ found in file "env0.auto.tfvars.json". If you meant to use this value, add
│ a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global"
```
</details>


```
Monthly cost change for tomer-landesman/templates/.env0workdir/env0_tf_plan.json
Amount:  +$9 ($0.00 → $9)

```
<details>
<summary>Cost Estimation Details</summary>

```diff
──────────────────────────────────
Project: tomer-landesman/templates/.env0workdir/env0_tf_plan.json

+ aws_instance.example_server
  +$9

+     Instance usage (Linux/UNIX, on-demand, t2.micro)
      +$8

+     root_block_device
    
+         Storage (general purpose SSD, gp2)
          +$0.80

Monthly cost change for tomer-landesman/templates/.env0workdir/env0_tf_plan.json
Amount:  +$9 ($0.00 → $9)

──────────────────────────────────
Key: ~ changed, + added, - removed

1 cloud resource was detected:
∙ 1 was estimated, it includes usage-based costs, see https://infracost.io/usage-file

Infracost estimate: Monthly cost will increase by $9 ↑
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━┓
┃ Project                                                  ┃ Cost change ┃ New monthly cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━━━━┫
┃ tomer-landesman/templates/.env0workdir/env0_tf_plan.json ┃         +$9 ┃ $9               ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━━━━┛
```
</details>


[Full PR Plan logs on env0](http://dev.dev.env0.com/p/6b1b0897-5322-48cd-98b7-5e11766f54c8/environments/ae57739c-ca27-40e1-acf0-d2a0185a7a75/deployments/77b5cc25-5c37-42ca-a2a1-7f8351f3ae9a)